print('''
프로그램 언어 어려운점
 - 포인터 : 파이썬은 제외
 - 클래스 : 파이썬은 어렵지 않음, Django이외는 많이 사용하고 있지 않음
프로그래밍 언어
 - 절차 지향 프로그래밍
 - 객체 지향 프로그래밍
 - 함수형 프로그램밍
- 객체 지향 프로그램밍 ( OOP : Oriented Programming Language )
 - 프로그래밍 언어 - 영어
  >  I  love  you.
   주어 동사 목적어
  > love you : 명령형
 - 초기 프로그래밍 언어 : 명령형
  > print('안녕하세요') 
     동사   목적어  => 안녕하세요를 출력해라는 명령어
  > str(172) => 동사 + 목적어 > 명령 ( 172를 문자열로 바꿔라 )
  > 주어가 없이 명령만하는 대상으로 컴퓨터를 인식함 
 - 프로그램이 커지면서 우리가 사는 세상으로 인식하게됨
  > 우리가 해야 하는 것 = 세상을 만드는 것
  > 세상 안에 무엇이 있는가?
  > 세상에 모든 것이 객체
 - 병원에서 환자를 관리하는 프로그램
  > 병원을 하나의 세상으로 보고
  > 이 안에는 어떠한 객체들이 있을까?
  > 환자, 간호사, 의사, 병실, 아침 식사등 다양한 것을 생각하고
  > 객체들이 하는 일들을 생각한다.
  > 환자 = 면회를 간다 [동작]
  > 의사 = 진찰을 한다 [동작] + 환자를[목적어]
  > 의사.진찰한다(환자를) => 객체 지향 프로그래밍
  > 세계 안에서 어떤한 객체가 어떠한 것을 대상으로 어떠한 동작을 하게 된다.
 - string = '안녕하세요'
 - string.다양한함수()
 - string.split('하') => ['안녕','세요']
 - string씨 잘라주세요 하를, 즉 string씨 하를 잘라 주세요
 - 주어 + 동사 + 목적어 : 객체 지향 프로그램
 - 세상안에 움직이며 돌아다니게 하는 것
''')

